app/controllers/boards_controller.rb

  def index
    @board = Board.new(params[:board])

    if @board.location_id
        #if we're in here, that means someone searched by the dropdown list of locations
        @location = Location.find(@board.location_id)
    else
      if params[:location]
        @location = Location.new(params[:location])
        #we have to save this search location in order for geocoding to work on it
        @location.save
      else
        #if we didn't get a location on the search params we need to make one
        @location = Location.new
      end
    end

    # we pull up all the locations that the user has previously entered
    # because he might want to use one of these for the search he's about to perform
    @locations = Location.find_all_by_creator_id(current_user.id) unless current_user.nil?

    @boards = Board.search(@location)
---
SELECT * FROM "boards"

  def show
    @board = Board.find(params[:id])
---
SELECT * FROM "boards" WHERE ("boards"."id" = 0)

  def create
    @board = Board.new(params[:board])

    # if the location id is nill then we must be making a new location
    if @board.location_id.nil?
      @location = Location.new(params[:location])
      if @location.save
        @board.location_id = @location.id
      end
    end

    respond_to do |format|
      if @board.save
---
INSERT INTO "locations" ("region", "created_at", "country", "postal_code", "updated_at", "street", "locality") VALUES(E'CO', '2009-06-11 12:49:24.933790', E'USA', E'80203', '2009-06-11 12:49:24.933790', E'1095 Sherman St', E'Denver') RETURNING "id"
INSERT INTO "boards" ("model", "created_at", "thickness", "style_id", "updated_at", "maker", "user_id", "location_id", "length", "description", "construction", "width") VALUES(E'Blammer', '2009-06-12 16:42:57.814866', 2.4375, 0, '2009-06-12 16:42:57.814866', E'Blam Boards', NULL, 7, 86, E'smooth board', E'Foam and fiberglass', 19.875) RETURNING "id"