app/controllers/locations_controller.rb

SELECT * FROM "locations" WHERE ("locations"."id" = 0)
---
  def show
    @location = Location.find(params[:id])