app/controllers/styles_controller.rb

SELECT * FROM "styles" WHERE (name LIKE E'%%')
---
  def index
    @styles = Style.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])