app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session

    #figure out what type of user we need to make
    if params[:is_shop] == 'yes'
      @user = Shop.new(params[:user])
    else
      @user = Surfer.new(params[:user])
    end
    if @user.save
---
INSERT INTO "users" ("salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES(E'142329f5a4399e7c8535f71513fe89228b495b33', '2009-05-05 19:35:57.839511', E'72c2feb0c0ce18f5f8cb2511ec09a649144990fd', NULL, '2009-05-05 19:35:57.839511', NULL, E'mr.jonc', E'mr.jonc@gmail.com') RETURNING "id"